SpenceKonde/megaTinyCore/megaavr/boards.txt
##############################################################

atxy2o.name=ATtiny412/402/212/202 (optiboot)
atxy2o.upload.speed=115200

#atxy2o.menu.chip.812=ATtiny812
#atxy2o.menu.chip.812.build.mcu=attiny812
#atxy2o.menu.chip.812.upload.maximum_size=8192
#atxy2o.menu.chip.812.upload.maximum_data_size=512
#atxy2o.menu.chip.812.upload.workaround=
atxy2o.menu.chip.412=ATtiny412
atxy2o.menu.chip.412.build.mcu=attiny412
atxy2o.menu.chip.412.upload.maximum_size=4096
atxy2o.menu.chip.412.upload.maximum_data_size=256
atxy2o.menu.chip.412.upload.workaround=
atxy2o.menu.chip.212=ATtiny212
atxy2o.menu.chip.212.build.mcu=attiny212
atxy2o.menu.chip.212.upload.maximum_size=2048
atxy2o.menu.chip.212.upload.maximum_data_size=128
atxy2o.menu.chip.212.upload.workaround=
#atxy2o.menu.chip.802=ATtiny802
#atxy2o.menu.chip.802.build.mcu=attiny802
#atxy2o.menu.chip.802.upload.maximum_size=8192
#atxy2o.menu.chip.802.upload.maximum_data_size=512
#atxy2o.menu.chip.802.upload.workaround=
atxy2o.menu.chip.402=ATtiny402
atxy2o.menu.chip.402.build.mcu=attiny402
atxy2o.menu.chip.402.upload.maximum_size=4096
atxy2o.menu.chip.402.upload.maximum_data_size=256
atxy2o.menu.chip.402.upload.workaround=
atxy2o.menu.chip.402w=ATtiny402 (bad signature)
atxy2o.menu.chip.402w.build.mcu=attiny402
atxy2o.menu.chip.402w.upload.maximum_size=4096
atxy2o.menu.chip.402w.upload.maximum_data_size=256
atxy2o.menu.chip.402w.upload.workaround=w
atxy2o.menu.chip.202=ATtiny202
atxy2o.menu.chip.202.build.mcu=attiny202
atxy2o.menu.chip.202.upload.maximum_size=2048
atxy2o.menu.chip.202.upload.maximum_data_size=128
atxy2o.menu.chip.202.upload.workaround=

atxy2o.menu.clock.20=20 MHz
atxy2o.menu.clock.16=16 MHz
atxy2o.menu.clock.10=10 MHz
atxy2o.menu.clock.8=8 MHz
atxy2o.menu.clock.5=5 MHz
atxy2o.menu.clock.4=4 MHz
atxy2o.menu.clock.1=1 MHz
atxy2o.menu.clock.20.build.f_cpu=20000000L
atxy2o.menu.clock.16.build.f_cpu=16000000L
atxy2o.menu.clock.10.build.f_cpu=10000000L
atxy2o.menu.clock.8.build.f_cpu=8000000L
atxy2o.menu.clock.5.build.f_cpu=5000000L
atxy2o.menu.clock.4.build.f_cpu=4000000L
atxy2o.menu.clock.1.build.f_cpu=1000000L
atxy2o.menu.clock.20.bootloader.OSCCFG=0x02
atxy2o.menu.clock.16.bootloader.OSCCFG=0x01
atxy2o.menu.clock.10.bootloader.OSCCFG=0x02
atxy2o.menu.clock.8.bootloader.OSCCFG=0x01
atxy2o.menu.clock.5.bootloader.OSCCFG=0x02
atxy2o.menu.clock.4.bootloader.OSCCFG=0x01
atxy2o.menu.clock.1.bootloader.OSCCFG=0x01

atxy2o.menu.dacvref.0v55=0.55V
atxy2o.menu.dacvref.1v1=1.10V
atxy2o.menu.dacvref.1v5=1.50V
atxy2o.menu.dacvref.2v5=2.50V
atxy2o.menu.dacvref.4v3=4.30V
atxy2o.menu.dacvref.0v55.build.dacvref=-DDACVREF=0
atxy2o.menu.dacvref.1v1.build.dacvref=-DDACVREF=1
atxy2o.menu.dacvref.1v5.build.dacvref=-DDACVREF=4
atxy2o.menu.dacvref.2v5.build.dacvref=-DDACVREF=2
atxy2o.menu.dacvref.4v3.build.dacvref=-DDACVREF=3

atxy2o.menu.millis.enabled=Enabled
atxy2o.menu.millis.disabled=Disabled (saves flash)
atxy2o.menu.millis.enabled.build.millis=
atxy2o.menu.millis.disabled.build.millis=-DDISABLEMILLIS

atxy2o.menu.bodvoltage.1v8=1.8V
atxy2o.menu.bodvoltage.2v15=2.15V
atxy2o.menu.bodvoltage.2v6=2.6V
atxy2o.menu.bodvoltage.2v95=2.95V
atxy2o.menu.bodvoltage.3v3=3.30V
atxy2o.menu.bodvoltage.3v7=3.70V
atxy2o.menu.bodvoltage.4v0=4.00V
atxy2o.menu.bodvoltage.4v3=4.30V
atxy2o.menu.bodvoltage.4v3.bootloader.bodlevbits=111
atxy2o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy2o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy2o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy2o.menu.bodvoltage.2v95.bootloader.bodlevbits=011
atxy2o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy2o.menu.bodvoltage.2v15.bootloader.bodlevbits=001
atxy2o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy2o.menu.bodmodeactive.disabled=Disabled
atxy2o.menu.bodmodeactive.enabled=Enabled
atxy2o.menu.bodmodeactive.sampled=Sampled
atxy2o.menu.bodmodeactive.enabledhold=Enabled hold wakeup
atxy2o.menu.bodmodesleep.disabled=Disabled
atxy2o.menu.bodmodesleep.enabled=Enabled
atxy2o.menu.bodmodesleep.sampled=Sampled
atxy2o.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
atxy2o.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
atxy2o.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
atxy2o.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
atxy2o.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
atxy2o.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
atxy2o.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10

atxy2o.upload.tool=avrdude
atxy2o.upload.protocol=arduino
atxy2o.upload.extra_params=-D
atxy2o.build.text_section_start=.text=0x200
atxy2o.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
atxy2o.bootloader.tool=avrdude


atxy2o.menu.uartpins.alternate=TX:2, RX:3
atxy2o.menu.uartpins.standard=TX:0, RX:1
atxy2o.menu.uartpins.alternate.build.uartpins=-DUARTREMAP
atxy2o.menu.uartpins.alternate.bootloader.uartswap=_alt
atxy2o.menu.uartpins.standard.build.uartpins=
atxy2o.menu.uartpins.standard.bootloader.uartswap=

atxy2o.upload.workaround=

atxy2o.bootloader.WDTCFG=0x00
atxy2o.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
atxy2o.bootloader.TCD0CFG=0x00
atxy2o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}01
atxy2o.bootloader.SYSCFG1=0x03
atxy2o.bootloader.APPEND=0x00
atxy2o.bootloader.BOOTEND=0x02

atxy2o.menu.resetpin.UPDI=UPDI (powercycle to enter bootloader)
atxy2o.menu.resetpin.UPDI.bootloader.file=optiboot_x/optiboot_txy2{bootloader.uartswap}.hex
atxy2o.menu.resetpin.UPDI.bootloader.resetpinbits=01
atxy2o.menu.resetpin.reset=Reset (DANGER - Read docs first!)
atxy2o.menu.resetpin.reset.bootloader.file=optiboot_x/optiboot_txy2{bootloader.uartswap}_rst.hex
atxy2o.menu.resetpin.reset.bootloader.resetpinbits=10
